app/views/users/display.html.erb

      <tbody>
        <% Song.all.each do |song| %>
        <% if Add.where(user: @user).where(song: song).count > 0 %>
---
SELECT "songs".* FROM "songs"
SELECT COUNT(*) FROM "adds" WHERE "adds"."user_id" = 7 AND "adds"."song_id" = 1