app/views/users/show.html.erb

SELECT COUNT(*) FROM "adds" WHERE "adds"."song_id" = $1  [["song_id", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "adds" ON "users"."id" = "adds"."user_id" WHERE "adds"."song_id" = $1 AND "users"."id" = $2 LIMIT $3  [["song_id", 1], ["id", 7], ["LIMIT", 1]]
---
			<td><a href="/songs/<%= song.id %>"><%= song.title %></a></td>
			<td><%= song.adds.count %> Adds </td>
			<% song.users.include?(current_user) %>