app/views/songs/index.html.erb

        <% @users.each do |user| %>
        <% if Add.find_by_song_id_and_user_id(@song.id, user.id)  %>
---
SELECT  "adds".* FROM "adds" WHERE "adds"."song_id" = $1 AND "adds"."user_id" = $2 LIMIT $3  [["song_id", 1], ["user_id", 6], ["LIMIT", 1]]

            <td><a href="/users/show/<%= user.id %>"><%= user.first_name %> <%= user.last_name %></a></td>
            <td><%= Add.where(song: @song).where(user: user.id).count %></td>
---
SELECT COUNT(*) FROM "adds" WHERE "adds"."song_id" = 1 AND "adds"."user_id" = 7