app/controllers/adds_controller.rb

  def create
  	Add.create(user: current_user, song_id: params[:id])
---
INSERT INTO "adds" ("user_id", "song_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 7], ["song_id", 1], ["created_at", "2019-10-18 16:28:23.690370"], ["updated_at", "2019-10-18 16:28:23.690370"]]