app/controllers/sessions_controller.rb

    def create
        if user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "lauren@gmail.com"], ["LIMIT", 1]]