app/controllers/songs_controller.rb

  def index
  	if Song.find_by_id(params[:id])
      @song = Song.find(params[:id])
      @users = User.all
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def create
  	@song = Song.create(title: params[:title], artist: params[:artist], user_id: current_user.id)
---
INSERT INTO "songs" ("title", "artist", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Song 1"], ["artist", "Artist 1"], ["user_id", 7], ["created_at", "2019-10-18 15:41:01.168953"], ["updated_at", "2019-10-18 15:41:01.168953"]]