app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "first_name", "last_name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
  	user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "songs".* FROM "songs"
---
  def show
  	@user = User.find(params[:id])
  	@current_user = @user
    @all_songs = Song.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Amy edited"], ["updated_at", "2019-10-18 03:39:47.193975"], ["id", 6]]
---
  def update
  	@user = User.find(current_user.id)
    if @user.update(name: params[:name], email: params[:email])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def display
    @user = User.find(params[:id])

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
---
  def destroy
  	user = current_user
    user.delete